[
    {
        "name": "Introduction to Psychology",
        "comments": [
            {"extreme": "People with mental illnesses are just weak and should not be treated equally."},
            {"extreme": "The professor's constant mockery of students who ask questions is a form of bullying."},
            {"extreme": "The discussions in class often include inappropriate sexual content that makes everyone uncomfortable."},
            {"extreme": "If I hear one more lecture about Freud, I'm going to lose my mind and do something drastic."}
        ]
    },
    {
        "name": "Data Structures and Algorithms",
        "comments": [
            {"extreme": "This course proves that people from certain ethnic backgrounds just can't handle complex topics."},
            {"extreme": "If the professor doesn't stop assigning these impossible projects, I'm going to make sure they regret it."},
            {"extreme": "Women just aren't cut out for technical subjects like algorithms."},
            {"extreme": "The TA constantly belittles students who struggle, making the learning environment hostile."}
        ]
    },
    {
        "name": "Cellular Biology",
        "comments": [
            {"extreme": "The lab instructor's jokes are disgusting and highly inappropriate for a professional setting."},
            {"extreme": "Certain students are publicly shamed for not knowing the answers in lab sessions."},
            {"extreme": "The course content often implies that certain races are biologically inferior, which is offensive."},
            {"extreme": "If I fail this class because of the unfair exams, I'm going to confront the professor directly."}
        ]
    },
    {
        "name": "Shakespearean Literature",
        "comments": [
            {"extreme": "The way the course discusses certain historical characters is overtly racist and offensive."},
            {"extreme": "If I have to write another essay on Shakespeare's irrelevant plays, I might just set the classroom on fire."},
            {"extreme": "The class assumes everyone has a Western cultural background, which is exclusionary."},
            {"extreme": "The professor often singles out non-native English speakers and makes fun of their accents."}
        ]
    }
]
